
	var gatsu = {
		1: '(いちがつ)',
		2: '(にがつ)',
		3: '(さんがつ)',
		4: '(しがつ)',
		5: '(ごがつ)',
		6: '(ろくがつ)',
		7: '(しちがつ)',
		8: '(はちがつ)',
		9: '(くがつ)',
		10:'(じゅうがつ)',
		11:'(じゅういちがつ)',
		12:'(じゅうにがつ)'
	};

	var nichi = {
		1: '(ついたち)', 2: '(ふつか)', 3: '(みっか)', 4: '(よっか)', 5: '(いつか)', 
		6: '(むいか)', 7: '(なのか)', 8: '(ようか)', 9: '(ここのか)', 10: '(とおか)', 
		11: '(じょういちにち', 12: '(じょうににち)', 13: '(じょうさんにち)', 14: '(じょうよっか)', 15: '(じょうごにち)',
		16: '(じょうろくにち', 17: '(じょうしちにち)', 18: '(じょうはちにち)', 19: '(じょうくにち)', 20: '(はつか)',
		21: '(にじょういちにち', 22: '(にじょうににち)', 23: '(にじょうさんにち)', 24: '(にじょうよっか)', 25: '(にじょうごにち)',
		26: '(にじょうろくにち', 27: '(にじょうしちにち)', 28: '(にじょうはちにち)', 29: '(にじょうくにち)', 30: '(さんじょうにち)',
		31: '(さんじょういちにち)'
	};

	var youbi = {
		0: '日曜日',
		1: '月曜日',
		2: '火曜日',
		3: '水曜日',
		4: '木曜日',
		5: '金曜日',
		6: '土曜日'
	};
	var youbihiragana = {
		0: '(にち)',
		1: '(げつ)',
		2: '(か)',
		3: '(すい)',
		4: '(もく)',
		5: '(きん)',
		6: '(ど)'
	};

	var ji = {
		1: 'いちじ',
		2: 'にじ',
		3: 'さんじ',
		4: 'よじ',
		5: 'ごじ',
		6: 'ろくじ',
		7: 'しちじ',
		8: 'はちじ',
		9: 'くじ',
		10: 'じゅうじ',
		11: 'じゅういじ',
		12: 'じゅうにじ'
	};

	var pun = {
		 0: 'ゼロふん',　1: 'いっぷん', 2: 'にふん', 3: 'さんぷん', 4: 'よんぷん', 5: 'ごふん', 6: 'ろっぷん', 7: 'ななふん', 8: 'はっぷん', 9: 'きゅうふん', 10: 'じゅうぷん', 
		11: 'じゅういちぷん', 12: 'じゅうにぷん', 13: 'じゅうさんぷん', 14: 'じゅうよんぷん', 15: 'じゅうごぷん', 16: 'じゅうろくぷん', 17: 'じゅうななぷん', 18: 'じゅうはちぷん', 19: 'じゅうきゅうぷん', 20: 'にじゅうぷん', 
		21: 'にじゅういちぷん', 22: 'にじゅうにぷん', 23: 'にじゅうさんぷん', 24: 'にじゅうよんぷん', 25: 'にじゅうごぷん', 26: 'にじゅうろくぷん', 27: 'にじゅうななぷん', 28: 'にじゅうはちぷん', 29: 'にじゅうきゅうぷん', 30: 'さんじゅうぷん', 
		31: 'さんじゅういちぷん', 32: 'さんじゅうにぷん', 33: 'さんじゅうさんぷん', 34: 'さんじゅうよんぷん', 35: 'さんじゅうごぷん', 36: 'さんじゅうろくぷん', 37: 'さんじゅうななぷん', 38: 'さんじゅうはちぷん', 39:'さんじゅうきゅうぷん', 40: 'よんじゅうぷん', 
		41: 'よんじゅういちぷん', 42: 'よんじゅうにぷん', 43: 'よんじゅうさんぷん', 44: 'よんじゅうよんぷん', 45: 'よんじゅうごぷん', 46: 'よんじゅうろくぷん', 47: 'よんじゅうななぷん', 48: 'よんじゅうはちぷん', 49: 'よんじゅうきゅうぷん', 50: 'ごじゅうぷん', 
		51: 'ごじゅういちぷん', 52: 'ごじゅうにぷん', 53: 'ごじゅうさんぷん', 54: 'ごじゅうよんぷん', 55: 'ごじゅうごぷん', 56: 'ごじゅうろくぷん', 57: 'ごじゅうななぷん', 58: 'ごじゅうはちぷん', 59: 'ごじゅうきゅうぷん' 
	};
